%include 'in_out.asm'
SECTION .data ; Секция инициированных данных
msg: DB 'Введите строку: ',0h ; Сообщение
SECTION .bss ; Секция не иницированных данных
buf1: RESB 80 ; Буфер обмена 80 байт
SECTION .text ; Код программы
GLOBAL _start ; Начало программы
_start: ; Точка входа в программу
mov eax, msg ; Запись адреса выводимого сообщения в 'EAX'
call sprint ; Вызов подпрограммы печати сообщения
mov ecx, buf1 ; Запись адреса переменной в 'EAX'
mov edx, 80 ; Запись длины вводимого сообщения в 'EBX'
call sread ; Вызов подпрограммы ввода сообщения
mov eax,4 ; Системный вызов для записи (sys_write)
mov ebx,1 ; Описатель файла '1' - стандартный вывод
mov ecx,buf1 ; Адрес строки buf1 в ecx
int 80h ; Вызов ядра
call quit ; Вызов подпрограммы завершения